Repository: jimregan/citizens-information-raw
Catalog: en-pl/www.citizensinformation.ie/pl/reference/checklists/checklist_glossary_of_employment_terms.html.txt.tmx
Source language: en
Languages: pl

source: Glossary of employment terms
pl: Słowniczek terminów dotyczących zatrudnienia

source: │Adoptive leave │Adoptive leave is leave from work for an adoptive mother or sole male adopter │ │ │after the adoption of a child
pl: │Urlop adopcyjny │Urlop adopcyjny to urlop dla matki adopcyjnej lub samotnego ojca adopcyjnego po adoptowaniu dziecka

source: │Agency worker │Someone who is employed by an agency to work for another person or company
pl: │Pracownik agencyjny │Osoba zatrudniona przez agencję do pracy na rzecz innej osoby lub firmy

source: │Annual leave │Annual leave is paid time off work for holidays, rest or recreation
pl: │Urlop wypoczynkowy │Urlop wypoczynkowy to płatny czas wolny przeznaczany na wakacje, odpoczynek lub rekreację

source: │Breaks │Short periods of time for rest and refreshment taken during working hours
pl: │Przerwy │Krótkie przerwy w godzinach pracy na odpoczynek i posiłek

source: │Bullying │In the workplace bullying is repeated inappropriate behaviour by one or more │ │ │people against another person or people
pl: │Mobbing │W miejscu pracy mobbing oznacza powtarzające się niewłaściwe zachowania przejawiane przez jedną osobę lub więcej osób w stosunku do innej osoby lub osób

source: │Career break │An unpaid period of time away from your employment which can be for family │ │ │reasons or study, which is approved by your employer
pl: │Przerwa w życiu zawodowym │Bezpłatny okres przerwy w pracy spowodowany sprawami rodzinnymi lub nauką, który został zatwierdzony przez pracodawcę

source: │ │Carer’s leave is leave from work to care someone who is deemed by the │ │Carer’s leave │Department of Social Protection as being in need of full-time care and │ │ │attention
pl: │Urlop opiekuńczy │Urlop opiekuńczy to urlop w celu opieki nad osobą, która została uznana przez Ministerstwo Ochrony Spoleczna za osobę wymagającą stałej opieki i uwagi

source: │Casual worker │A person employed as required without fixed hours or attendance arrangements │
pl: │Pracownik dorywczy │Osoba zatrudniana w miarę potrzeby bez ustalania stałych godzin pracy lub wymogów dotyczących obecności │

source: │Code of │A code of practice sets out good practice in employment but is not usually │
pl: │Kodeks postępowania │Kodeks postępowania określa dobre praktyki w zatrudnieniu, ale zazwyczaj nie jest prawnie wiążący │

source: │Collective │Agreements negotiated between unions and employers about terms and conditions │ │agreements │of employment
pl: │Porozumienia zbiorowe │Porozumienia negocjowane pomiędzy związkami zawodowymi i pracodawcami dotyczące warunków i zasad zatrudnienia

source: │Common law │Law derived from custom and court decisions, rather than legislation
pl: │Common law (prawo powszechne) │Prawo oparte na zwyczaju i orzecznictwie sądów, a nie legislacji

source: │Constructive │Constructive dismissal is when you terminate your contract of employment │ │dismissal │because of your employer’s behaviour
pl: │Wymuszone zwolnienie │Wymuszone zwolnienie to sytuacja, w której pracownik rozwiązuje swoją umowę o pracę ze względu na postępowanie pracodawcy

source: │Continuity of │This means the employee’s service or employment is unbroken and can help you │ │employment or │qualify for certain employment rights such as redundancy
pl: │Ciągłość zatrudnienia lub pracy │Oznacza to, że praca lub zatrudnienie pracownika jest nieprzerwane, co może pomóc mu uzyskać pewne prawa pracownicze, takie jak odprawa

source: │Critical Skills│A Critical Skills Employment Permit is an employment permit for occupations │
pl: │Zwyczaj i praktyka │Zwyczaj i praktyka mają zastosowanie, jeżeli zasady zatrudnienia są regulowane zwyczajowym zachowaniem w pracy, a nie przepisami lub pisemną umową

source: │Employment │with an annual salary above €60,000 and for some occupations with an annual │
pl: Przykładem może być nieformalna dziesięciominutowa przerwa na kawę o godz. 11:00

source: │Custom and │Custom and practice is where a term of employment is set up by normal behaviour│ │practice │in a workplace rather than by legislation or a written contract. One example is│
pl: │Potrącenia │Potrącenia oznaczają kwoty potrącane z wypłaty pracownika i wykazane na pasku wypłaty, na przykład składki na ubezpieczenie społeczne (PRSI)

source: │Deductions │Deductions are amounts taken off your pay and listed on your payslip, for │ │ │example, PRSI
pl: │Procedura dyscyplinarna │Określa w formie pisemnej sposób postępowania pracodawcy w przypadku wystąpienia domniemanych uchybień ze strony pracownika

source: │Disciplinary │It sets out in writing how the employer will deal with the alleged shortcomings│
pl: │Dyskryminacja │Oznacza traktowanie jednej osoby w sposób gorszy niż pozostałe osoby

source: │ ├───────────────┼───────────────────────────────────────────────────────────────────────────────┤ │ │This means treating one person less favourably than another person
pl: Dyskryminacja w pracy jest nielegalna, jeżeli opiera się na płci, stanie cywilnym, stanie rodzinnym, orientacji seksualnej, religii, wieku, niepełnosprawności, rasie, przynależności do społeczności wędrującej

source: │Discrimination │Discrimination at work is illegal if it is based on gender, civil status, │
pl: │Zwolnienie z pracy │Ze zwolnieniem mamy do czynienia, kiedy rozwiązuje się umowę o pracę

source: │ │family status, sexual orientation, religion, age, disability, race, membership │ │ │of the Traveller community
pl: Jeżeli pracownik zostaje zwolniony przez pracodawcę, może być uprawniony do wystąpienia z roszczeniem z tytułu nieuzasadnionego zwolnienia

source: If you are dismissed by │ │ │your employer you may be able to claim unfair dismissal
pl: │Pracownik domowy │Pracownik domowy to osoba zatrudniona do pracy w prywatnym domu

source: │Domestic worker│A domestic worker is someone who is employed to work in a private home
pl: Oznacza to, że pracownik nie powinien być zmuszany do pracy w warunkach niebezpiecznych lub szkodliwych dla zdrowia

source: │ │Your employer owes you a duty of care to provide a safe workplace and this is │
pl: │Pracownik │Pracownik to osoba pracująca dla kogoś w zamian za wynagrodzenie

source: │ │have to work in unsafe or unhealthy conditions
pl: W prawie pracy nie ma definicji "pracownika"

source: │ │An employee is someone works for someone else in return for payment
pl: Status zatrudnienia danej osoby jest ogólnie określany przez urząd skarbowy lub Ministerstwo Ochrony Spoleczna

source: │Employee │determining Employment Status (pdf) contains criteria which can be used to │ │ │clarify whether a person is employed or self-employed. The employment status of│
pl: │Zezwolenie na zatrudnienie │Większość obywateli państw nie należących do EOG musi posiadać zezwolenie na zatrudnienie, żeby podjąć pracę w Irlandii

source: │Employment │EROs are negotiated by Joint Labour Committees to regulate conditions of │ │Regulation │employment and pay in certain employment sectors
pl: │Umowa na czas określony │Umowa na czas określony to umowa o pracę, która ulega rozwiązaniu w określonym dniu

source: │Fixed-term │A fixed-term contract is a contract of employment which ends on an agreed date.│
pl: │Urlop z tytułu wypadku losowego │Urlop dla pracownika z powodu nagłych potrzeb w związku z chorobą lub wypadkiem któregoś z członków rodziny

source: │Force majeure │Leave from work for an employee for urgent reasons because of the illness or │ │leave │injury of a family member
pl: │Swoboda informacji (FOI) │Przepisy FOI umożliwiają pracownikowi dostęp do dokumentów przechowywanych przez ministerstwa i różne organy publiczne

source: │Grievance │This sets out how to complain about something in your employment terms and │ │procedure │conditions which affects you
pl: │Ciężkie naruszenie obowiązków │Rażąco niewłaściwe zachowanie w pracy, takie jak napaść, kradzież, mobbing lub prześladowanie

source: │ │Under employment equality legislation harassment on any of the 9 discriminatory│ │Harassment │grounds is illegal
pl: │Prześladowanie │Na mocy prawa dotyczącego równouprawnienia prześladowanie oparte na którejkolwiek z 9 podstaw dyskryminacji jest bezprawne

source: It is defined as behaviour “which has the purpose or effect│ │ │of violating a person’s dignity and creating an intimidating, hostile, │ │ │degrading, humiliating or offensive environment for the person”
pl: Jest definiowane jako zachowanie, „którego celem lub skutkiem jest naruszenie godności osobistej jakiejś osoby oraz stworzenie zastraszającego, nieprzyjaznego, poniżającego, upokarzającego lub przykrego środowiska pracy dla danej osoby”

source: │Holiday │A holiday is paid time off work for rest and recreation
pl: │Urlop │Urlop to płatny czas wolny od pracy przeznaczany na wypoczynek lub rekreację

source: It can mean either │ │ │annual leave or a public holiday
pl: Może oznaczać urlop wypoczynkowy lub dni ustawowo wolne od pracy

source: │Jobsharing │A type of flexible work where two people share the same employment position
pl: │Współdzielenie pracy │Rodzaj elastycznej pracy, gdy dwie osoby dzielą to samo stanowisko pracy

source: │Joint Labour │JLCs regulate conditions of employment in certain employment sectors
pl: │JLC czyli wspólne komitety pracy │JLC regulują warunki zatrudnienia w określonych sektorach zatrudnienia

source: Their │ │Committees │agreements are called Employment Regulation Orders (EROs)
pl: Ich uzgodnienia określa się mianem porozumień zbiorowych Employment Regulation Orders (ERO)

source: │Labour market │This is a requirement for most General Employment Permit applications. It means│
pl: │Badanie potrzeb rynku pracy │Jest to wymóg mający zastosowanie w przypadku większości wniosków o pozwolenie na pracę

source: │needs test │advertising a vacancy with the EURES employment network for 8 weeks and in │ │ │local and national newspapers for 6 days
pl: Oznacza ogłoszenie wolnego stanowiska w sieci zatrudnienia EURES oraz lokalnych i krajowych gazetach przez 3 dni

source: │Lay off │Lay off is when you are let go from your job temporarily as your employer has │ │ │no work for you
pl: │Przymusowy urlop │Przymusowy urlop oznacza tymczasowe zwolnienie z pracy, ponieważ pracodawca nie jest w stanie zapewnić pracownikowi pracy

source: Under employment rights legislation there │
pl: │Urlop │Pozwolenie na nieobecność w pracy

source: │Leave │are statutory entitlements to annual leave, maternity leave, adoptive leave, │ │ │parental leave and carer's leave
pl: Na mocy prawodawstwa dotyczącego praw pracowniczych istnieją ustawowe uprawnienia do urlopu wypoczynkowego, urlopu macierzyńskiego, urlopu adopcyjnego, urlopu wychowawczego iurlopu opiekuńczego

source: │Maternity leave│Maternity leave is leave from work for a woman who is pregnant or who has just │ │ │given birth
pl: │Urlop macierzyński │Urlop macierzyński to urlop dla kobiety ciężarnej lub kobiety, która właśnie urodziła dziecko

source: │Migrant worker │Someone who is not a national of the country where they are working
pl: │Pracownik migrujący │Pracownik, który nie jest obywatelem kraju, w którym pracuje

source: │Minimum wage │This is a minimum hourly rate of pay. Most employees have a legal right to the │
pl: │Minimalne wynagrodzenie │Jest to minimalna stawka godzinowa płacy

source: │ │national minimum wage (NMW)
pl: Większość pracowników jest uprawnionych do otrzymywania minimalnej stawki wynagrodzenia (NMW)

source: │Night work │Under the Organisation of Working Time Act 1997 night work means work done │
pl: │Nocna zmiana │Na mocy Ustawy o organizacji czasu pracy z 1997 r

source: │ │between midnight and 7am
pl: nocna zmiana oznacza pracę wykonywaną pomiędzy północą i godz. 7:00

source: │Notice │Notice is an announcement by the employee or employer that the employment │ │ │contract will end on a certain date
pl: │Wypowiedzenie │Wypowiedzenie to informacja od pracownika lub pracodawcy, że umowa o pracę zostanie rozwiązana w określonym dniu

source: │Open-ended │This is a contract of employment which continues until the employer or employee│ │contract │ends it
pl: │Umowa na czas nieokreślony │Jest to umowa o pracę, która obowiązuje do czasu rozwiązania przez pracodawcę lub pracownika

source: It is known as a contract of indefinite duration. This is what │
pl: Oznacza to, że okres jej obowiązywania jest nieokreślony

source: │ │employees often refer to as a permanent job
pl: Pracownicy często określają ją jako stałe zatrudnienie

source: │Overtime │Overtime is work done outside normal working hours
pl: │Godziny nadliczbowe │Praca w godzinach nadliczbowych to praca wykonywana poza normalnym czasem pracy

source: │P45 │stating your pay, tax, USC and PRSI contributions deducted from the start of │
pl: │P45 │Kiedy pracownik odchodzi z pracy, pracodawca przekazuje mu formularz P45

source: │ │the tax year to the last day of your job
pl: Jest to zaświadczenie wykazujące jego wynagrodzenie, podatki i składki na ubezpieczenie społeczne odprowadzone od początku roku podatkowego do ostatniego dnia pracy

source: │ │At the end of each tax year your employer gives you a P60 form. It is a │
pl: │P60 │Na koniec każdego roku podatkowego pracodawca przekazuje pracownikowi formularz P60

source: │P60 │certificate stating your pay, tax, USC and PRSI contributions deducted during │ │ │the year
pl: Jest to zaświadczenie wykazujące wynagrodzenie, podatki i składki na ubezpieczenie społeczne odprowadzone w ciągu roku

source: │Parental leave │Parental leave is leave from work for parents of children aged under 8 (16 if │ │ │the child has a disability)
pl: │Urlop wychowawczy │Urlop wychowawczy to urlop dla rodziców dzieci poniżej 8 roku życia (16 w przypadku dzieci niepełnosprawnych)

source: │ │Paternity leave is leave from work for a parent (other than the mother) │
pl: │Urlop ojcowski │Urlop ojcowski to urlop dla ojców po urodzeniu się ich dzieci

source: │Paternity leave│following the birth or adoption of a child
pl: Nie ma ustawowego uprawnienia do urlopu ojcowskiego

source: │PAYE │PAYE (Pay As You Earn) is the system where tax is deducted from your wages by │ │ │your employer and sent to the Revenue Commissioners
pl: │PAYE │PAYE (Pay As You Earn - płacenie podatku przy otrzymywaniu płacy) to system, w ramach którego podatek jest odliczany z wynagrodzenia pracownika przez pracodawcę i przekazywany do urzędu skarbowego

source: │Pension │A pension is a payment from the State or a private company to someone who is │ │ │retired
pl: │Emerytura │Emerytura to wypłata od państwa lub prywatnej firmy na rzecz osoby będącej na emeryturze

source: │Probationary │A specified period at the start of an employment to see if the employee is │ │period │suitable for the job
pl: │Okres próbny │Określony okres na początku zatrudnienia, podczas którego pracodawca może sprawdzić, czy pracownik nadaje się na dane stanowisko

source: │PRSA │PRSAs (Personal Retirement Savings Accounts) are a type of pension arrangement.│
pl: │PRSA │PRSA (Personal Retirement Savings Accounts - indywidualny emerytalny rachunek oszczędnościowy) to rodzaj programu emerytalnego

source: │ │PRSI (Pay Related Social Insurance) means the social insurance contributions │
pl: │PRSI │PRSI (Pay Related Social Insurance) to składki na ubezpieczenie społeczne potrącane z wynagrodzenia pracownika

source: │PRSI │deducted from your wages. Your PRSI contributions help you to qualify for │ │ │social welfare payments such as Illness Benefit
pl: Składki PRSI pomagają zakwalifikować się do otrzymywania świadczeń socjalnych, takich jak zasiłek chorobowy

source: │ │There are 9 public holidays each year, for example, Christmas Day
pl: │Dni ustawowo wolne od pracy │Jest 9 dni ustawowo wolnych od pracy w każdym roku, na przykład pierwszy dzień Świąt Bożego Narodzenia

source: │Public holidays│statutory public holiday entitlement for employees is: either a paid day off, │ │ │an extra day of annual leave or a day's pay
pl: │Redukcja etatu │Redukcja etatu oznacza, że pracownik traci pracę, ponieważ pracodawca nie jest w stanie zapewnić mu pracy lub zakład zostaje zamknięty

source: │Redundancy │Redundancy is when your job ceases to exist because of lack of work or your │
pl: Jest to zbiorowe porozumienie zarejestrowane w Sądzie Pracy

source: │Registered │REAs set out pay and conditions of employment in certain employment sectors
pl: │Okresy odpoczynku │Okres odpoczynku to czas nie będący czasem pracy

source: │Employment │They are collective agreements which have been registered with the Labour │ │Agreement (REA)│Court
pl: │Samozatrudnienie │Osoba samozatrudniona to osoba prowadząca własną działalność gospodarczą i nie będąca pracownikiem

source: ├───────────────┼───────────────────────────────────────────────────────────────────────────────┤ │Rest period │A rest period is any time that is not working time
pl: │Molestowanie seksualne │Niepożądane zachowanie o charakterze seksualnym, które narusza godność osobistą kobiet i mężczyzn w pracy - patrz także prześladowanie

source: │Sexual │Unwanted behaviour of a sexual nature that affects the dignity of women and men│ │harassment │at work – see also harassment
pl: │Umowa o dzieło │Umowa o pracę, która zostaje rozwiązana po wykonaniu określonego zadania lub wystąpieniu określonego zdarzenia

source: │Specified │A contract of employment which ends when a specific task is completed, or when │
pl: │Uprawnienie ustawowe │Uprawnienie wynikające z przepisów prawa

source: │Dependant/ │A Dependant/Partner/Spouse Employment Permit is issued to the spouse, civil │ │Partner/Spouse │partner, partner or dependant of a Critical Skills Employment Permit holder or │ │Employment │researcher
pl: │Związek zawodowy │Związek zawodowy to organizacja, która odpowiada za negocjowanie z pracodawcą lepszego wynagrodzenia i warunków

source: │Trade union │A trade union is an organisation which negotiates with an employer for better │ │ │pay and conditions
pl: │Przejęcie zakładu │Przejęcie zakładu następuje, gdy firma zostaje przejęta przez inną firmę lub gdy następuje połączenie dwóch firm

source: │Victimisation │Victimisation or penalisation is unfair treatment of a employee by an employer │
pl: │Wynagrodzenie │Wynagrodzenie to pieniądze płacone przez pracodawcę pracownikowi za wykonaną przez niego pracę

source: │ │because of some action the worker has taken, such as claiming the minimum wage.│
pl: Wypłaty te są również określane jako płaca lub pensja

source: ├───────────────┼───────────────────────────────────────────────────────────────────────────────┤ │ │Wages are the money paid to you by your employer for your work
pl: Czasami wynagrodzenie może być uzupełnione innymi świadczeniami, na przykład wyżywieniem i zakwaterowaniem, jeżeli są zapewniane przez pracodawcę i są ujęte w umowie o pracę

source: │ │included to make up your wages, for example board and lodging, if supplied by │ │ │your employer and are part of your employment contract
pl: │Pozwolenie na pracę │Pozwolenie na pracę to rodzaj zezwolenia na zatrudnienie wydawanego dla niektórych zawodów, w przypadku których roczne wynagrodzenie wynosi od 30 000 EUR do 60 000 EUR oraz kilku zawodów z wynagrodzeniem poniżej 30 000 EUR

source: │Working hours │This means the time when you are working
pl: │Godziny pracy │Oznaczają czas, kiedy wykonywana jest praca

source: For most employees the legal maximum │ │ │average working week is 48 hours
pl: W przypadku większości pracowników maksymalny średni tydzień pracy wynosi 48 godzin
